#map0 = affine_map<(d0, d1) -> (0, d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
#map2 = affine_map<(d0, d1, d2, d3) -> (0, 0, 0, d3)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
#map4 = affine_map<(d0, d1, d2, d3) -> ()>
#map5 = affine_map<(d0, d1, d2) -> (d0, d1)>
#map6 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map7 = affine_map<(d0, d1, d2) -> (0, d1, d2)>
#map8 = affine_map<(d0, d1, d2) -> (d0, d1, 0)>
#map9 = affine_map<(d0, d1, d2) -> (0, d1, 0)>
#map10 = affine_map<(d0, d1, d2) -> (d2)>
#map11 = affine_map<(d0, d1) -> (d1, d0)>
#map12 = affine_map<(d0, d1, d2) -> (d1, d2)>
#map13 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d1, d3)>
#map14 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3, d2)>
#map15 = affine_map<(d0, d1, d2, d3) -> (0, d1, d2, d3)>
#map16 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, 0)>
#map17 = affine_map<(d0, d1, d2, d3) -> (0, d1, d2, 0)>
#map18 = affine_map<(d0, d1) -> (d1)>
module attributes {torch.debug_module_name = "OnlyLogitsHuggingFaceModel"} {
  func.func @forward(%arg0: tensor<1x12xi64>) -> tensor<1x2xf32> {
    %cst = arith.constant dense_resource<__elided__> : tensor<2x384xf32>
    %cst_0 = arith.constant dense<[-0.00115577725, 0.00115577038]> : tensor<2xf32>
    %cst_1 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_2 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_3 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_4 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_5 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_6 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_7 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_8 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_9 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_10 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_11 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_12 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_13 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_14 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_15 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_16 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_17 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_18 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_19 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_20 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_21 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_22 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_23 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_24 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_25 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_26 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_27 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_28 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_29 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_30 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_31 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_32 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_33 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_34 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_35 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_36 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_37 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_38 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_39 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_40 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_41 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_42 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_43 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_44 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_45 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_46 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_47 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_48 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_49 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_50 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_51 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_52 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_53 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_54 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_55 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_56 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_57 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_58 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_59 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_60 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_61 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_62 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_63 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_64 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_65 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_66 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_67 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_68 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_69 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_70 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_71 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_72 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_73 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_74 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_75 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_76 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_77 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_78 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_79 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_80 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_81 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_82 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_83 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_84 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_85 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_86 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_87 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_88 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_89 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_90 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_91 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_92 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_93 = arith.constant dense<5.6568542494923806> : tensor<f64>
    %cst_94 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_95 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_96 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_97 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_98 = arith.constant dense_resource<__elided__> : tensor<384x384xf32>
    %cst_99 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_100 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_101 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_102 = arith.constant dense_resource<__elided__> : tensor<512x384xf32>
    %cst_103 = arith.constant dense_resource<__elided__> : tensor<2x384xf32>
    %cst_104 = arith.constant dense_resource<__elided__> : tensor<30522x384xf32>
    %cst_105 = arith.constant dense_resource<__elided__> : tensor<1x512xi64>
    %cst_106 = arith.constant dense<-3.4028234663852886E+38> : tensor<f64>
    %cst_107 = arith.constant dense<0> : tensor<1x512xi64>
    %cst_108 = arith.constant 1.000000e+00 : f32
    %c512 = arith.constant 512 : index
    %c30522 = arith.constant 30522 : index
    %cst_109 = arith.constant 0.000000e+00 : f32
    %cst_110 = arith.constant -3.40282347E+38 : f32
    %cst_111 = arith.constant 1.41421354 : f32
    %cst_112 = arith.constant 5.000000e-01 : f32
    %c0_i64 = arith.constant 0 : i64
    %cst_113 = arith.constant 9.9999999999999998E-13 : f64
    %cst_114 = arith.constant 3.840000e+02 : f32
    %c2 = arith.constant 2 : index
    %0 = tensor.extract_slice %cst_107[0, 0] [1, 12] [1, 1] : tensor<1x512xi64> to tensor<1x12xi64>
    %1 = linalg.init_tensor [1, 12] : tensor<1x12xi64>
    %2 = linalg.generic {indexing_maps = [#map0, #map1], iterator_types = ["parallel", "parallel"]} ins(%0 : tensor<1x12xi64>) outs(%1 : tensor<1x12xi64>) {
    ^bb0(%arg1: i64, %arg2: i64):
      linalg.yield %arg1 : i64
    } -> tensor<1x12xi64>
    %3 = linalg.init_tensor [1, 1, 1, 12] : tensor<1x1x1x12xf32>
    %4 = linalg.fill ins(%cst_108 : f32) outs(%3 : tensor<1x1x1x12xf32>) -> tensor<1x1x1x12xf32>
    %5 = linalg.generic {indexing_maps = [#map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%4 : tensor<1x1x1x12xf32>) outs(%3 : tensor<1x1x1x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.subf %cst_108, %arg1 : f32
      linalg.yield %670 : f32
    } -> tensor<1x1x1x12xf32>
    %6 = linalg.generic {indexing_maps = [#map2, #map4, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%5, %cst_106 : tensor<1x1x1x12xf32>, tensor<f64>) outs(%3 : tensor<1x1x1x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f64, %arg3: f32):
      %670 = arith.truncf %arg2 : f64 to f32
      %671 = arith.mulf %arg1, %670 : f32
      linalg.yield %671 : f32
    } -> tensor<1x1x1x12xf32>
    %7 = tensor.extract_slice %cst_105[0, 0] [1, 12] [1, 1] : tensor<1x512xi64> to tensor<1x12xi64>
    %8 = linalg.init_tensor [1, 12, 384] : tensor<1x12x384xf32>
    %9 = linalg.generic {indexing_maps = [#map5, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%arg0 : tensor<1x12xi64>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: i64, %arg2: f32):
      %670 = arith.index_cast %arg1 : i64 to index
      %671 = linalg.index 2 : index
      %672 = arith.cmpi slt, %670, %c30522 : index
      cf.assert %672, "index must be smaller than dim size"
      %673 = arith.cmpi sge, %arg1, %c0_i64 : i64
      cf.assert %673, "index must be larger or equal to 0"
      %674 = tensor.extract %cst_104[%670, %671] : tensor<30522x384xf32>
      linalg.yield %674 : f32
    } -> tensor<1x12x384xf32>
    %10 = linalg.generic {indexing_maps = [#map5, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%2 : tensor<1x12xi64>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: i64, %arg2: f32):
      %670 = arith.index_cast %arg1 : i64 to index
      %671 = linalg.index 2 : index
      %672 = arith.cmpi slt, %670, %c2 : index
      cf.assert %672, "index must be smaller than dim size"
      %673 = arith.cmpi sge, %arg1, %c0_i64 : i64
      cf.assert %673, "index must be larger or equal to 0"
      %674 = tensor.extract %cst_103[%670, %671] : tensor<2x384xf32>
      linalg.yield %674 : f32
    } -> tensor<1x12x384xf32>
    %11 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%9, %10 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %12 = linalg.generic {indexing_maps = [#map5, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%7 : tensor<1x12xi64>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: i64, %arg2: f32):
      %670 = arith.index_cast %arg1 : i64 to index
      %671 = linalg.index 2 : index
      %672 = arith.cmpi slt, %670, %c512 : index
      cf.assert %672, "index must be smaller than dim size"
      %673 = arith.cmpi sge, %arg1, %c0_i64 : i64
      cf.assert %673, "index must be larger or equal to 0"
      %674 = tensor.extract %cst_102[%670, %671] : tensor<512x384xf32>
      linalg.yield %674 : f32
    } -> tensor<1x12x384xf32>
    %13 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%11, %12 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %14 = linalg.init_tensor [1, 12, 1] : tensor<1x12x1xf32>
    %15 = linalg.fill ins(%cst_109 : f32) outs(%14 : tensor<1x12x1xf32>) -> tensor<1x12x1xf32>
    %16 = linalg.generic {indexing_maps = [#map6, #map8], iterator_types = ["parallel", "parallel", "reduction"]} ins(%13 : tensor<1x12x384xf32>) outs(%15 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %17 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%16 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.divf %arg1, %cst_114 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %18 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%17 : tensor<1x12x1xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %19 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%13, %18 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.subf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %20 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%19 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.mulf %arg1, %arg1 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %21 = linalg.fill ins(%cst_109 : f32) outs(%14 : tensor<1x12x1xf32>) -> tensor<1x12x1xf32>
    %22 = linalg.generic {indexing_maps = [#map6, #map8], iterator_types = ["parallel", "parallel", "reduction"]} ins(%20 : tensor<1x12x384xf32>) outs(%21 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %23 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%22 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.divf %arg1, %cst_114 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %24 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%23 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.truncf %cst_113 : f64 to f32
      %671 = arith.addf %arg1, %670 : f32
      linalg.yield %671 : f32
    } -> tensor<1x12x1xf32>
    %25 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%24 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = math.rsqrt %arg1 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %26 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%25 : tensor<1x12x1xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %27 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%19, %26 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.mulf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %28 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%27, %cst_100 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.mulf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %29 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%28, %cst_101 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %30 = linalg.init_tensor [384, 384] : tensor<384x384xf32>
    %31 = linalg.generic {indexing_maps = [#map1, #map11], iterator_types = ["parallel", "parallel"]} ins(%cst_98 : tensor<384x384xf32>) outs(%30 : tensor<384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<384x384xf32>
    %32 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%29 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %33 = linalg.init_tensor [1, 384, 384] : tensor<1x384x384xf32>
    %34 = linalg.generic {indexing_maps = [#map12, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%31 : tensor<384x384xf32>) outs(%33 : tensor<1x384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x384x384xf32>
    %35 = linalg.fill ins(%cst_109 : f32) outs(%8 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %36 = linalg.batch_matmul ins(%32, %34 : tensor<1x12x384xf32>, tensor<1x384x384xf32>) outs(%35 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %37 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%36, %cst_99 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %38 = linalg.generic {indexing_maps = [#map1, #map11], iterator_types = ["parallel", "parallel"]} ins(%cst_96 : tensor<384x384xf32>) outs(%30 : tensor<384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<384x384xf32>
    %39 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%29 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %40 = linalg.generic {indexing_maps = [#map12, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%38 : tensor<384x384xf32>) outs(%33 : tensor<1x384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x384x384xf32>
    %41 = linalg.fill ins(%cst_109 : f32) outs(%8 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %42 = linalg.batch_matmul ins(%39, %40 : tensor<1x12x384xf32>, tensor<1x384x384xf32>) outs(%41 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %43 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%42, %cst_97 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %44 = tensor.expand_shape %43 [[0], [1], [2, 3]] : tensor<1x12x384xf32> into tensor<1x12x12x32xf32>
    %45 = linalg.init_tensor [1, 12, 12, 32] : tensor<1x12x12x32xf32>
    %46 = linalg.generic {indexing_maps = [#map3, #map13], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%44 : tensor<1x12x12x32xf32>) outs(%45 : tensor<1x12x12x32xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x12x32xf32>
    %47 = linalg.generic {indexing_maps = [#map1, #map11], iterator_types = ["parallel", "parallel"]} ins(%cst_94 : tensor<384x384xf32>) outs(%30 : tensor<384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<384x384xf32>
    %48 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%29 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %49 = linalg.generic {indexing_maps = [#map12, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%47 : tensor<384x384xf32>) outs(%33 : tensor<1x384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x384x384xf32>
    %50 = linalg.fill ins(%cst_109 : f32) outs(%8 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %51 = linalg.batch_matmul ins(%48, %49 : tensor<1x12x384xf32>, tensor<1x384x384xf32>) outs(%50 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %52 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%51, %cst_95 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %53 = tensor.expand_shape %52 [[0], [1], [2, 3]] : tensor<1x12x384xf32> into tensor<1x12x12x32xf32>
    %54 = linalg.generic {indexing_maps = [#map3, #map13], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%53 : tensor<1x12x12x32xf32>) outs(%45 : tensor<1x12x12x32xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x12x32xf32>
    %55 = tensor.expand_shape %37 [[0], [1], [2, 3]] : tensor<1x12x384xf32> into tensor<1x12x12x32xf32>
    %56 = linalg.generic {indexing_maps = [#map3, #map13], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%55 : tensor<1x12x12x32xf32>) outs(%45 : tensor<1x12x12x32xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x12x32xf32>
    %57 = linalg.init_tensor [1, 12, 32, 12] : tensor<1x12x32x12xf32>
    %58 = linalg.generic {indexing_maps = [#map3, #map14], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%46 : tensor<1x12x12x32xf32>) outs(%57 : tensor<1x12x32x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x32x12xf32>
    %59 = linalg.generic {indexing_maps = [#map15, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%56 : tensor<1x12x12x32xf32>) outs(%45 : tensor<1x12x12x32xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x12x32xf32>
    %60 = linalg.generic {indexing_maps = [#map15, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%58 : tensor<1x12x32x12xf32>) outs(%57 : tensor<1x12x32x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x32x12xf32>
    %61 = tensor.collapse_shape %59 [[0, 1], [2], [3]] : tensor<1x12x12x32xf32> into tensor<12x12x32xf32>
    %62 = tensor.collapse_shape %60 [[0, 1], [2], [3]] : tensor<1x12x32x12xf32> into tensor<12x32x12xf32>
    %63 = linalg.init_tensor [12, 12, 12] : tensor<12x12x12xf32>
    %64 = linalg.fill ins(%cst_109 : f32) outs(%63 : tensor<12x12x12xf32>) -> tensor<12x12x12xf32>
    %65 = linalg.batch_matmul ins(%61, %62 : tensor<12x12x32xf32>, tensor<12x32x12xf32>) outs(%64 : tensor<12x12x12xf32>) -> tensor<12x12x12xf32>
    %66 = tensor.expand_shape %65 [[0, 1], [2], [3]] : tensor<12x12x12xf32> into tensor<1x12x12x12xf32>
    %67 = linalg.init_tensor [1, 12, 12, 12] : tensor<1x12x12x12xf32>
    %68 = linalg.generic {indexing_maps = [#map15, #map4, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%66, %cst_93 : tensor<1x12x12x12xf32>, tensor<f64>) outs(%67 : tensor<1x12x12x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f64, %arg3: f32):
      %670 = arith.truncf %arg2 : f64 to f32
      %671 = arith.divf %arg1, %670 : f32
      linalg.yield %671 : f32
    } -> tensor<1x12x12x12xf32>
    %69 = linalg.generic {indexing_maps = [#map15, #map2, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%68, %6 : tensor<1x12x12x12xf32>, tensor<1x1x1x12xf32>) outs(%67 : tensor<1x12x12x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x12x12xf32>
    %70 = linalg.init_tensor [1, 12, 12, 1] : tensor<1x12x12x1xi64>
    %71 = linalg.fill ins(%c0_i64 : i64) outs(%70 : tensor<1x12x12x1xi64>) -> tensor<1x12x12x1xi64>
    %72 = linalg.init_tensor [1, 12, 12, 1] : tensor<1x12x12x1xf32>
    %73 = linalg.fill ins(%cst_110 : f32) outs(%72 : tensor<1x12x12x1xf32>) -> tensor<1x12x12x1xf32>
    %74:2 = linalg.generic {indexing_maps = [#map3, #map16, #map16], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%69 : tensor<1x12x12x12xf32>) outs(%73, %71 : tensor<1x12x12x1xf32>, tensor<1x12x12x1xi64>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: i64):
      %670 = linalg.index 3 : index
      %671 = arith.index_cast %670 : index to i64
      %672 = arith.maxf %arg1, %arg2 : f32
      %673 = arith.cmpf ogt, %arg1, %arg2 : f32
      %674 = arith.select %673, %671, %arg3 : i64
      linalg.yield %672, %674 : f32, i64
    } -> (tensor<1x12x12x1xf32>, tensor<1x12x12x1xi64>)
    %75 = linalg.generic {indexing_maps = [#map15, #map17, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%69, %74#0 : tensor<1x12x12x12xf32>, tensor<1x12x12x1xf32>) outs(%67 : tensor<1x12x12x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.subf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x12x12xf32>
    %76 = linalg.generic {indexing_maps = [#map15, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%75 : tensor<1x12x12x12xf32>) outs(%67 : tensor<1x12x12x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = math.exp %arg1 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x12x12xf32>
    %77 = linalg.fill ins(%cst_109 : f32) outs(%72 : tensor<1x12x12x1xf32>) -> tensor<1x12x12x1xf32>
    %78 = linalg.generic {indexing_maps = [#map3, #map16], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%76 : tensor<1x12x12x12xf32>) outs(%77 : tensor<1x12x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x12x1xf32>
    %79 = linalg.generic {indexing_maps = [#map15, #map17, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%76, %78 : tensor<1x12x12x12xf32>, tensor<1x12x12x1xf32>) outs(%67 : tensor<1x12x12x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.divf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x12x12xf32>
    %80 = linalg.generic {indexing_maps = [#map15, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%79 : tensor<1x12x12x12xf32>) outs(%67 : tensor<1x12x12x12xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x12x12xf32>
    %81 = linalg.generic {indexing_maps = [#map15, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%54 : tensor<1x12x12x32xf32>) outs(%45 : tensor<1x12x12x32xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x12x32xf32>
    %82 = tensor.collapse_shape %80 [[0, 1], [2], [3]] : tensor<1x12x12x12xf32> into tensor<12x12x12xf32>
    %83 = tensor.collapse_shape %81 [[0, 1], [2], [3]] : tensor<1x12x12x32xf32> into tensor<12x12x32xf32>
    %84 = linalg.init_tensor [12, 12, 32] : tensor<12x12x32xf32>
    %85 = linalg.fill ins(%cst_109 : f32) outs(%84 : tensor<12x12x32xf32>) -> tensor<12x12x32xf32>
    %86 = linalg.batch_matmul ins(%82, %83 : tensor<12x12x12xf32>, tensor<12x12x32xf32>) outs(%85 : tensor<12x12x32xf32>) -> tensor<12x12x32xf32>
    %87 = tensor.expand_shape %86 [[0, 1], [2], [3]] : tensor<12x12x32xf32> into tensor<1x12x12x32xf32>
    %88 = linalg.generic {indexing_maps = [#map3, #map13], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%87 : tensor<1x12x12x32xf32>) outs(%45 : tensor<1x12x12x32xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x12x32xf32>
    %89 = tensor.collapse_shape %88 [[0], [1], [2, 3]] : tensor<1x12x12x32xf32> into tensor<1x12x384xf32>
    %90 = linalg.generic {indexing_maps = [#map1, #map11], iterator_types = ["parallel", "parallel"]} ins(%cst_91 : tensor<384x384xf32>) outs(%30 : tensor<384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<384x384xf32>
    %91 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%89 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %92 = linalg.generic {indexing_maps = [#map12, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%90 : tensor<384x384xf32>) outs(%33 : tensor<1x384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x384x384xf32>
    %93 = linalg.fill ins(%cst_109 : f32) outs(%8 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %94 = linalg.batch_matmul ins(%91, %92 : tensor<1x12x384xf32>, tensor<1x384x384xf32>) outs(%93 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %95 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%94, %cst_92 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %96 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%95, %29 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %97 = linalg.fill ins(%cst_109 : f32) outs(%14 : tensor<1x12x1xf32>) -> tensor<1x12x1xf32>
    %98 = linalg.generic {indexing_maps = [#map6, #map8], iterator_types = ["parallel", "parallel", "reduction"]} ins(%96 : tensor<1x12x384xf32>) outs(%97 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %99 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%98 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.divf %arg1, %cst_114 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %100 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%99 : tensor<1x12x1xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %101 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%96, %100 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.subf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %102 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%101 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.mulf %arg1, %arg1 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %103 = linalg.fill ins(%cst_109 : f32) outs(%14 : tensor<1x12x1xf32>) -> tensor<1x12x1xf32>
    %104 = linalg.generic {indexing_maps = [#map6, #map8], iterator_types = ["parallel", "parallel", "reduction"]} ins(%102 : tensor<1x12x384xf32>) outs(%103 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %105 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%104 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.divf %arg1, %cst_114 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %106 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%105 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.truncf %cst_113 : f64 to f32
      %671 = arith.addf %arg1, %670 : f32
      linalg.yield %671 : f32
    } -> tensor<1x12x1xf32>
    %107 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%106 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = math.rsqrt %arg1 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %108 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%107 : tensor<1x12x1xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %109 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%101, %108 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.mulf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %110 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%109, %cst_89 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.mulf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %111 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%110, %cst_90 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %112 = linalg.init_tensor [384, 1536] : tensor<384x1536xf32>
    %113 = linalg.generic {indexing_maps = [#map1, #map11], iterator_types = ["parallel", "parallel"]} ins(%cst_87 : tensor<1536x384xf32>) outs(%112 : tensor<384x1536xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<384x1536xf32>
    %114 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%111 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %115 = linalg.init_tensor [1, 384, 1536] : tensor<1x384x1536xf32>
    %116 = linalg.generic {indexing_maps = [#map12, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%113 : tensor<384x1536xf32>) outs(%115 : tensor<1x384x1536xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x384x1536xf32>
    %117 = linalg.init_tensor [1, 12, 1536] : tensor<1x12x1536xf32>
    %118 = linalg.fill ins(%cst_109 : f32) outs(%117 : tensor<1x12x1536xf32>) -> tensor<1x12x1536xf32>
    %119 = linalg.batch_matmul ins(%114, %116 : tensor<1x12x384xf32>, tensor<1x384x1536xf32>) outs(%118 : tensor<1x12x1536xf32>) -> tensor<1x12x1536xf32>
    %120 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%119, %cst_88 : tensor<1x12x1536xf32>, tensor<1536xf32>) outs(%117 : tensor<1x12x1536xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1536xf32>
    %121 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%120 : tensor<1x12x1536xf32>) outs(%117 : tensor<1x12x1536xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.divf %arg1, %cst_111 : f32
      %671 = math.erf %670 : f32
      %672 = arith.addf %671, %cst_108 : f32
      %673 = arith.mulf %672, %cst_112 : f32
      %674 = arith.mulf %arg1, %673 : f32
      linalg.yield %674 : f32
    } -> tensor<1x12x1536xf32>
    %122 = linalg.init_tensor [1536, 384] : tensor<1536x384xf32>
    %123 = linalg.generic {indexing_maps = [#map1, #map11], iterator_types = ["parallel", "parallel"]} ins(%cst_85 : tensor<384x1536xf32>) outs(%122 : tensor<1536x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1536x384xf32>
    %124 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%121 : tensor<1x12x1536xf32>) outs(%117 : tensor<1x12x1536xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x1536xf32>
    %125 = linalg.init_tensor [1, 1536, 384] : tensor<1x1536x384xf32>
    %126 = linalg.generic {indexing_maps = [#map12, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%123 : tensor<1536x384xf32>) outs(%125 : tensor<1x1536x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x1536x384xf32>
    %127 = linalg.fill ins(%cst_109 : f32) outs(%8 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %128 = linalg.batch_matmul ins(%124, %126 : tensor<1x12x1536xf32>, tensor<1x1536x384xf32>) outs(%127 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %129 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%128, %cst_86 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %130 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%129, %111 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %131 = linalg.fill ins(%cst_109 : f32) outs(%14 : tensor<1x12x1xf32>) -> tensor<1x12x1xf32>
    %132 = linalg.generic {indexing_maps = [#map6, #map8], iterator_types = ["parallel", "parallel", "reduction"]} ins(%130 : tensor<1x12x384xf32>) outs(%131 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %133 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%132 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.divf %arg1, %cst_114 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %134 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%133 : tensor<1x12x1xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %135 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%130, %134 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.subf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %136 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%135 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.mulf %arg1, %arg1 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %137 = linalg.fill ins(%cst_109 : f32) outs(%14 : tensor<1x12x1xf32>) -> tensor<1x12x1xf32>
    %138 = linalg.generic {indexing_maps = [#map6, #map8], iterator_types = ["parallel", "parallel", "reduction"]} ins(%136 : tensor<1x12x384xf32>) outs(%137 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %139 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%138 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.divf %arg1, %cst_114 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %140 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%139 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = arith.truncf %cst_113 : f64 to f32
      %671 = arith.addf %arg1, %670 : f32
      linalg.yield %671 : f32
    } -> tensor<1x12x1xf32>
    %141 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%140 : tensor<1x12x1xf32>) outs(%14 : tensor<1x12x1xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      %670 = math.rsqrt %arg1 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x1xf32>
    %142 = linalg.generic {indexing_maps = [#map9, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%141 : tensor<1x12x1xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %143 = linalg.generic {indexing_maps = [#map7, #map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%135, %142 : tensor<1x12x384xf32>, tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.mulf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %144 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%143, %cst_83 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.mulf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %145 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%144, %cst_84 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %146 = linalg.generic {indexing_maps = [#map1, #map11], iterator_types = ["parallel", "parallel"]} ins(%cst_81 : tensor<384x384xf32>) outs(%30 : tensor<384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<384x384xf32>
    %147 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%145 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %148 = linalg.generic {indexing_maps = [#map12, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%146 : tensor<384x384xf32>) outs(%33 : tensor<1x384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x384x384xf32>
    %149 = linalg.fill ins(%cst_109 : f32) outs(%8 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %150 = linalg.batch_matmul ins(%147, %148 : tensor<1x12x384xf32>, tensor<1x384x384xf32>) outs(%149 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %151 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%150, %cst_82 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %152 = linalg.generic {indexing_maps = [#map1, #map11], iterator_types = ["parallel", "parallel"]} ins(%cst_79 : tensor<384x384xf32>) outs(%30 : tensor<384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<384x384xf32>
    %153 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%145 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %154 = linalg.generic {indexing_maps = [#map12, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%152 : tensor<384x384xf32>) outs(%33 : tensor<1x384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x384x384xf32>
    %155 = linalg.fill ins(%cst_109 : f32) outs(%8 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %156 = linalg.batch_matmul ins(%153, %154 : tensor<1x12x384xf32>, tensor<1x384x384xf32>) outs(%155 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %157 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%156, %cst_80 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
      %670 = arith.addf %arg1, %arg2 : f32
      linalg.yield %670 : f32
    } -> tensor<1x12x384xf32>
    %158 = tensor.expand_shape %157 [[0], [1], [2, 3]] : tensor<1x12x384xf32> into tensor<1x12x12x32xf32>
    %159 = linalg.generic {indexing_maps = [#map3, #map13], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%158 : tensor<1x12x12x32xf32>) outs(%45 : tensor<1x12x12x32xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x12x32xf32>
    %160 = linalg.generic {indexing_maps = [#map1, #map11], iterator_types = ["parallel", "parallel"]} ins(%cst_77 : tensor<384x384xf32>) outs(%30 : tensor<384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<384x384xf32>
    %161 = linalg.generic {indexing_maps = [#map7, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%145 : tensor<1x12x384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x12x384xf32>
    %162 = linalg.generic {indexing_maps = [#map12, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%160 : tensor<384x384xf32>) outs(%33 : tensor<1x384x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32):
      linalg.yield %arg1 : f32
    } -> tensor<1x384x384xf32>
    %163 = linalg.fill ins(%cst_109 : f32) outs(%8 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %164 = linalg.batch_matmul ins(%161, %162 : tensor<1x12x384xf32>, tensor<1x384x384xf32>) outs(%163 : tensor<1x12x384xf32>) -> tensor<1x12x384xf32>
    %165 = linalg.generic {indexing_maps = [#map7, #map10, #map6], iterator_types = ["parallel", "parallel", "parallel"]} ins(%164, %cst_78 : tensor<1x12x384xf32>, tensor<384xf32>) outs(%8 : tensor<1x12x384xf32>) {
    ^bb0(%arg1: f32, %arg2: f32, %arg3: f32):
